name: "pest_detector"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  { name: "image" data_type: TYPE_FP32 dims: [3, 640, 640] }
]

output [
  { name: "boxes"  data_type: TYPE_FP32 dims: [100, 4] },
  { name: "scores" data_type: TYPE_FP32 dims: [100] },
  { name: "labels" data_type: TYPE_INT64 dims: [100] },
  { name: "num"    data_type: TYPE_INT64 dims: [1] }
]

instance_group [
  { kind: KIND_GPU count: 1 }
]